ERP.belugaerp/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>бг_КодНоменклатурыКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВладелецНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/СопоставлениеНоменклатурыКонтрагентов/Module.bsl
#Область ПоискНоменклатурыКонтрагентов

// Возвращает номенклатуру контрагента найденную по номенклатуре информационной базы в строке таблицы.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД - владелец номенклатуры.
//  Номенклатура      	 - СправочникСсылка.Номенклатура. 
//
// Возвращаемое значение:
// ТаблицаЗначений - Если номенклатура контрагента не найдена возвращается Неопределено.
Функция бг_ДанныеНоменклатурыКонтрагентаПоНоменклатуре(Знач ВладелецНоменклатуры, Знач Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецНоменклатуры"   , ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура"           , Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураКонтрагентов.бг_КодНоменклатурыКонтрагента КАК бг_КодНоменклатурыКонтрагента,
	|	НоменклатураКонтрагентов.Артикул КАК Артикул,
	|	НоменклатураКонтрагентов.Код КАК Код,
	|	НоменклатураКонтрагентов.Характеристика КАК Характеристика,
	|	НоменклатураКонтрагентов.Упаковка КАК Упаковка,
	|	НоменклатураКонтрагентов.Представление КАК Представление
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
	|	И НоменклатураКонтрагентов.Номенклатура = &Номенклатура
	|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И НЕ НоменклатураКонтрагентов.Недействителен";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
